function lab02_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #2 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ
%
% Використовуйте файли даних: 
% ecg117.dat - сигнал EКГ 
% ecg_2х60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #2')
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ')
disp('Виконав: ..., група ... ІАСУ')

%=== Завдання #1.1 ===
% Реалізація фільтру Хеннінга, обчислення АЧХ та ФЧХ
fs = 
b =		% коефіцієнти різницевого рівняння 
a = 
n = 	% кількість точок, що розраховуються
figure()
[] = freqz();
...
... введіть позначення осей графіків


%=== Завдання #1.2 ===
% Обчислення нулів фільтру
disp('Нулі фільтра Хеннінга') 
x = 


%=== Завдання #1.3 ===
% Фільтрація ЕКГ, файл ecg117.dat
fs = 
ecg = 		% сигнал ЕКГ
ecg = 
ecgf = 
t = 
figure()
...

%=== Завдання #2.1 ===
%Реалізація фільтру поліноміального згладжування
fs = 
bp = 		% коефіцієнти різницевого рівняння
ap = 
n =    % кількість точок, що розраховуються
figure()
[] = freqz();
...
... введіть позначення осей графіків
...
% Обчислення нулів фільтру
...
% Карта нулів та полюсів фільтру
...

%=== Завдання #2.2 ===
%Фільтрація ЕКГ файл ecg117.dat з використанням фільтру 
%поліноміального згладжування
ecgf5 = filter();
figure()
...

%=== Завдання #2.3 ===
%Порівняння властивостей згладжування сигналу фільтром Хеннінга 
%і поліноміальним фільтром
figure()
....

%=== Завдання #3.1 ===
% Дослідження властивостей простого режекторного фільтру
br =    % коефіцієнти різницевого рівняння 
ar = 
n =  	% кількість точок, що розраховуються
fs = 
figure()
[] = freqz();
...
... введіть позначення осей графіків
...

% Обчислення нулів фільтру
...
% Карта нулів та полюсів фільтру
...

% Побудова передавальної функції
H = filt ()

%=== Завдання #3.2 ===
% Фільтрація сигналу ЕКГ (файл ecg2х60.dat) режекторним фільтром
fs = 250;
ecg = 		% сигнал ЕКГ
ecg = 
ecgf = 
t = 	
figure()
...

%=== Завдання #4.1 ===
% Дослідження властивостей диференціаторів
% N = 1
fs = 
bd1 = 		% коефіцієнти різницевого рівняння 
ad1 = 
n = 		 % кількість точок, що розраховуються
figure()
[] = freqz();
...
... введіть позначення осей графіків
...

% N = 2
bd2 =    	% коефіцієнти різницевого рівняння 
ad2 = 
n = 	  % кількість точок, що розраховуються
figure()
[] = freqz();
...
... введіть позначення осей графіків
...

% Побудова передавальних функцій
H1 = filt ()
H2 = filt ()

%=== Завдання #4.2 ===
% Дослідження процесу диференціювання ЕКГ з шумом (файл ecg117.dat)
% N = 1
fs = 
ecg = 	% сигнал ЕКГ
ecgd1 = filter();
t = 
figure()
...

% N = 2
ecgd2 = 
t = 
figure()
...