function lab02_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #2 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ
%
% Використовуйте файли даних: 
% ecg117.dat - сигнал EКГ 
% ecg_2х60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%----------------------------------------------------------
 
clear, clc, close all
disp('Лабораторна робота #2');
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З СІХ');
disp('Виконав: Шелемба П.В., група БМ-462 ННІІДС');
 
%=== Завдання #1.1 ===
% Реалізація фільтру Хеннінга, обчислення АЧХ та ФЧХ
fs = 1000;
b = [1 2 1]/4; % коефіцієнти різницевого рівняння 
a = 1;
n = 512; % кількість точок, що розраховуються
figure(1);
[h, w] = freqz(b, a, n);
mag = abs(h);
phase = angle(h)*180/pi;
subplot(2, 1, 1); plot(w/(2*pi)*fs, mag), grid on;
title('АЧХ фільтру Хеннінга'); ylabel('Підсилення');
subplot(2, 1, 2); plot(w/(2*pi)*fs,unwrap(phase)), grid on;
title('ФЧХ фільтру Хеннінга'); xlabel('Частота'); ylabel('Фаза');

%=== Завдання #1.2 ===
% Обчислення нулів фільтру
disp('Нулі фільтра Хеннінга:');
x = roots(b);
disp(x);

%=== Завдання #1.3 ===
% Фільтрація ЕКГ, файл ecg117.dat
ecg = load('ecg117.dat'); % сигнал ЕКГ
ecgd = detrend(ecg);  
ecgf = filter(b, a, ecgd);
t1 = (0:length(ecgf)-1)/fs;
figure(2);
subplot(2, 1, 1); plot(t1, ecgd), grid on;
title('Сигнал ЕКГ з шумом');
xlim([0 1]);
ylabel('Амплітуда');
subplot (2, 1, 2); plot (t1, ecgf), grid on;
title('Відфільтрований сигнал ЕКГ');
xlim([0 1]);
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #2.1 ===
%Реалізація фільтру поліноміального згладжування
b2 = [-3, 12, 17, 12, -3]/35; % коефіцієнти різницевого рівняння
a2 = 1;
n2 = 5; % кількість точок, що розраховуються
figure(3);
[h2, w2] = freqz(b2, a2, n2);
mag2 = abs(h2);
phase2 = angle(h2)*180/pi;
subplot(2, 1, 1); plot(w2/(2*pi)*fs, mag2), grid on;
title('АЧХ поліноміального фільтру'); ylabel('Підсилення');
subplot(2, 1, 2); plot(w2/(2*pi)*fs,unwrap(phase2)), grid on;
title('ФЧХ поліноміального фільтру'); xlabel('Частота'); ylabel('Фаза');

% Обчислення нулів фільтру
disp('Нулі фільтра поліноміального згладжування:');
y = roots(b2);
disp(y);

% Карта нулів та полюсів фільтру
figure(4);
z = zplane(b2);
title('Карта нулів та полюсів поліноміального фільтру');

%=== Завдання #2.2 ===
%Фільтрація ЕКГ файл ecg117.dat з використанням фільтру 
%поліноміального згладжування
ecgf2 = filter(b2, a2, ecgd);
t2 = (0:length(ecgf2)-1)/fs;
figure(5);
subplot(2, 1, 1); plot (t2, ecgd), grid on; 
title('Сигнал ЕКГ з шумом');
xlim([0 1]);
ylabel('Амплітуда');
subplot(2, 1, 2); plot (t2, ecgf2), grid on;
title('Відфільтрований сигнал ЕКГ');
xlim([0 1]);
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #2.3 ===
%Порівняння властивостей згладжування сигналу фільтром Хеннінга 
%і поліноміальним фільтром
figure(6);
subplot(2, 1, 1); plot(t1, ecgf), grid on;
title('Згладжування сигналу фільтром Хеннінга');
xlim([0 1]);
ylabel('Амплітуда');
subplot(2, 1, 2); plot(t2, ecgf2), grid on;
title('Згладжування сигналу поліноміальним фільтром');
xlim([0 1]);
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #3.1 ===
% Дослідження властивостей простого режекторного фільтру
b3 = [1,0.618, 1]; % коефіцієнти різницевого рівняння 
a3 = 1; 
fs3 = 200;
[h3, f3] = freqz(b3, a3, n, fs3);
figure(7);
mag3 = abs(h3);
phase3 = angle(h3)*180/pi;
subplot(2, 1, 1); plot(f3/(2*pi)*fs3, mag3), grid on;
title('АЧХ режекторного фільтру'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f3/(2*pi)*fs3, unwrap(phase3)), grid on;
title('ФЧХ режекторного фільтру'); xlabel('Частота'); ylabel('Фаза');

% Обчислення нулів фільтру
disp('Нулі режекторного фільтру:');
x3 = roots(b3);
disp(x3);

% Карта нулів та полюсів фільтру
figure(8);
y3 = zplane(b3);
title('Карта нулів та полюсів режекторного фільтру');

% Побудова передавальної функції
disp('Аналітичний вираз передавальної функції режекторного фільтра:');
H = filt(b3, a3)

%=== Завдання #3.2 ===
% Фільтрація сигналу ЕКГ (файл ecg2х60.dat) режекторним фільтром
fs4 = 250;
ecg4 = load('ecg2x60.dat'); % сигнал ЕКГ
ecgd4 = detrend(ecg4);
ecgf4 = filter(b3, a3, ecgd4);
t4 = (0:length(ecgf4)-1)/fs4;  
figure(9);
subplot(2, 1, 1); plot(t4, ecgd4), grid on;
title('Cигнал ЕКГ з мережевою перешкодою 60 Гц');
xlim([0 1]);
ylabel('Амплітуда');
subplot(2, 1, 2); plot(t4, ecgf4), grid on;
title('Cигнал ЕКГ, відфільтрований режекторним фільтром');
xlim([0 1]);
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #4.1 ===
% Дослідження властивостей диференціаторів
% N = 1
bd1 = [1,-1]; % коефіцієнти різницевого рівняння 
ad1 = 1;
figure(10);
[h4, f4] = freqz(bd1, ad1, n, fs);
mag4 = abs(h4);
phase4 = angle(h4)*180/pi;
subplot(2, 1, 1); plot(f4/(2*pi)*fs, mag4), grid on;
title('АЧХ диференціатору при N=1'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f4/(2*pi)*fs, unwrap(phase4)), grid on;
title('ФЧХ диференціатору при N=1'); xlabel('Частота'); ylabel('Фаза');

% N = 2
bd2 = ([1,-1])/2; % коефіцієнти різницевого рівняння 
figure(11);
[h5, f5] = freqz(bd2, ad1, n, fs);
mag5 = abs(h5);
phase5 = angle(h5)*180/pi;
subplot(2, 1, 1); plot(f5/(2*pi)*fs, mag5), grid on;
title('АЧХ диференціатору при N=2'); ylabel('Підсилення');
subplot(2, 1, 2); plot(f5/(2*pi)*fs, unwrap(phase5)), grid on;
title('ФЧХ диференціатору при N=2'); xlabel('Частота'); ylabel('Фаза');

% Побудова передавальних функцій
disp('Передавальні функції диференеціаторів:')
H1 = filt (bd1, ad1)
H2 = filt (bd2, ad1)

%=== Завдання #4.2 ===
% Дослідження процесу диференціювання ЕКГ з шумом (файл ecg117.dat)
% N = 1
fs5 = 300;
ecgd1 = filter(bd1, ad1, ecgd);
t5 = (0:length(ecgd1)-1)/fs5;

% N = 2
ecgd2 = filter(bd2, ad1, ecgd);
t6 = (0:length(ecgd2)-1)/fs5;

% Порівняння
figure(12);
subplot (2, 1, 1); plot(t5, ecgd1), grid on;
title('Сигнал з використанням диференціатору при N=1');
xlim([0 1]);
ylabel('Амплітуда');
subplot (2, 1, 2); plot (t6, ecgd2); grid on;
title('Сигнал з використанням диференціатору при N=2');
xlim([0 1]);
xlabel('Відліки'); ylabel('Амплітуда');